RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Include/gd32h75e_fmc.h
/* FMC interrupt flags */
typedef enum {
    /* interrupt flags in STAT register */
    FMC_INT_FLAG_END = FMC_REGIDX_BIT2(FMC_CTL_REG_OFFSET, 16U, FMC_STAT_REG_OFFSET, 16U),                 /*!< flash end of operation interrupt flag */
    FMC_INT_FLAG_WPERR = FMC_REGIDX_BIT2(FMC_CTL_REG_OFFSET, 17U, FMC_STAT_REG_OFFSET, 17U),               /*!< flash erase/program protection error interrupt flag */
    FMC_INT_FLAG_PGSERR = FMC_REGIDX_BIT2(FMC_CTL_REG_OFFSET, 18U, FMC_STAT_REG_OFFSET, 18U),              /*!< flash program sequence error interrupt flag */
    FMC_INT_FLAG_RPERR = FMC_REGIDX_BIT2(FMC_CTL_REG_OFFSET, 23U, FMC_STAT_REG_OFFSET, 23U),               /*!< flash read protection error interrupt flag */
    FMC_INT_FLAG_RSERR = FMC_REGIDX_BIT2(FMC_CTL_REG_OFFSET, 24U, FMC_STAT_REG_OFFSET, 24U),               /*!< flash read secure error interrupt flag */
    FMC_INT_FLAG_ECCCOR = FMC_REGIDX_BIT2(FMC_CTL_REG_OFFSET, 25U, FMC_STAT_REG_OFFSET, 25U),              /*!< flash one bit error detected and correct interrupt flag */
    FMC_INT_FLAG_ECCDET = FMC_REGIDX_BIT2(FMC_CTL_REG_OFFSET, 26U, FMC_STAT_REG_OFFSET, 26U),              /*!< flash two bit errors detect interrupt flag */
    FMC_INT_FLAG_OBMERR = FMC_REGIDX_BIT2(FMC_OBCTL_REG_OFFSET, 30U, FMC_STAT_REG_OFFSET, 30U)             /*!< option byte modify error flag */
} fmc_interrupt_flag_enum;

/* FMC interrupt */
typedef enum {
    /* interrupt in CTL register */
    FMC_INT_END = FMC_REGIDX_BIT(FMC_CTL_REG_OFFSET, 16U),                 /*!< FMC end of operation interrupt */
    FMC_INT_WPERR = FMC_REGIDX_BIT(FMC_CTL_REG_OFFSET, 17U),               /*!< FMC erase/program protection error interrupt */
    FMC_INT_PGSERR = FMC_REGIDX_BIT(FMC_CTL_REG_OFFSET, 18U),              /*!< FMC program sequence error interrupt */
    FMC_INT_RPERR = FMC_REGIDX_BIT(FMC_CTL_REG_OFFSET, 23U),               /*!< FMC read protection error interrupt */
    FMC_INT_RSERR = FMC_REGIDX_BIT(FMC_CTL_REG_OFFSET, 24U),               /*!< FMC read secure error interrupt */
    FMC_INT_ECCCOR = FMC_REGIDX_BIT(FMC_CTL_REG_OFFSET, 25U),              /*!< FMC one bit correct error interrupt */
    FMC_INT_ECCDET = FMC_REGIDX_BIT(FMC_CTL_REG_OFFSET, 26U),              /*!< FMC two bits detect error interrupt */
    /* interrupt in OBCTL register */
    FMC_INT_OBMERR = FMC_REGIDX_BIT(FMC_OBCTL_REG_OFFSET, 30U)             /*!< FMC option byte modify error interrupt */
} fmc_interrupt_enum;

/* unlock key */
#define UNLOCK_KEY0                       ((uint32_t)0x45670123U)          /*!< unlock key 0 */
#define UNLOCK_KEY1                       ((uint32_t)0xCDEF89ABU)          /*!< unlock key 1 */

/* option byte unlock key */
#define OB_UNLOCK_KEY0                    ((uint32_t)0x08192A3BU)          /*!< option byte unlock key 0 */
#define OB_UNLOCK_KEY1                    ((uint32_t)0x4C5D6E7FU)          /*!< option byte unlock key 1 */

/* option byte BOR threshold value */
#define OBSTAT0_BOR_TH(regval)            (BITS(2,3) & ((uint32_t)(regval) << 2U))
#define OB_BOR_TH_OFF                     OBSTAT0_BOR_TH(0)                /*!< no BOR function */
#define OB_BOR_TH_VALUE1                  OBSTAT0_BOR_TH(1)                /*!< BOR threshold value 1 */
#define OB_BOR_TH_VALUE2                  OBSTAT0_BOR_TH(2)                /*!< BOR threshold value 2 */
#define OB_BOR_TH_VALUE3                  OBSTAT0_BOR_TH(3)                /*!< BOR threshold value 3 */

/* option byte software/hardware free watchdog timer */
#define OBSTAT0_NWDG_HW(regval)           (BIT(4) & ((uint32_t)(regval) << 4U))
#define OB_FWDGT_HW                       OBSTAT0_NWDG_HW(0)               /*!< hardware free watchdog */
#define OB_FWDGT_SW                       OBSTAT0_NWDG_HW(1)               /*!< software free watchdog */

/* option byte reset or not entering deep sleep mode */
#define OBSTAT0_NRST_DPSLP(regval)        (BIT(6) & ((uint32_t)(regval) << 6U))
#define OB_DEEPSLEEP_RST                  OBSTAT0_NRST_DPSLP(0)            /*!< generate a reset instead of entering deepsleep mode */
#define OB_DEEPSLEEP_NRST                 OBSTAT0_NRST_DPSLP(1)            /*!< no reset when entering deepsleep mode */

/* option byte reset or not entering standby mode */
#define OBSTAT0_NRST_STDBY(regval)        (BIT(7) & ((uint32_t)(regval) << 7U))
#define OB_STDBY_RST                      OBSTAT0_NRST_STDBY(0)            /*!< generate a reset instead of entering standby mode */
#define OB_STDBY_NRST                     OBSTAT0_NRST_STDBY(1)            /*!< no reset when entering standby mode */

/* option byte FWDGT status in deep-sleep mode */
#define OBSTAT0_FWDGSPD_DPSLP(regval)     (BIT(17) & ((uint32_t)(regval)<< 17U))
#define OB_DPSLP_FWDGT_SUSPEND            OBSTAT0_FWDGSPD_DPSLP(0)         /*!< free watchdog is suspended in deepsleep mode */
#define OB_DPSLP_FWDGT_RUN                OBSTAT0_FWDGSPD_DPSLP(1)         /*!< free watchdog is running in deepsleep mode */

/* option byte FWDGT status in standby mode */
#define OBSTAT0_FWDGSPD_STDBY(regval)     (BIT(18) & ((uint32_t)(regval) << 18U))
#define OB_STDBY_FWDGT_SUSPEND            OBSTAT0_FWDGSPD_STDBY(0)         /*!< free watchdog is suspended in standby mode */
#define OB_STDBY_FWDGT_RUN                OBSTAT0_FWDGSPD_STDBY(1)         /*!< free watchdog is running in standby mode */

/* option byte security access mode configuration */
#define OBSTAT0_SCR(regval)               (BIT(21) & ((uint32_t)(regval) << 21U))
#define OB_SECURE_MODE_DISABLE            OBSTAT0_SCR(0)                   /*!< secure access mode disable */
#define OB_SECURE_MODE_ENABLE             OBSTAT0_SCR(1)                   /*!< secure access mode enable */

/* option byte ITCM ECC function enable configuration */
#define OBSTAT0_ITCMECCEN(regval)         (BIT(22) & ((uint32_t)(regval) << 22U))
#define OB_ITCMECCEN_DISABLE              OBSTAT0_ITCMECCEN(0)             /*!< ITCM ECC function disable */
#define OB_ITCMECCEN_ENABLE               OBSTAT0_ITCMECCEN(1)             /*!< ITCM ECC function enable */

/* option byte DTCM0 ECC function enable configuration */
#define OBSTAT0_DTCM0ECCEN(regval)        (BIT(23) & ((uint32_t)(regval) << 23U))
#define OB_DTCM0ECCEN_DISABLE             OBSTAT0_DTCM0ECCEN(0)            /*!< DTCM0 ECC function disable */
#define OB_DTCM0ECCEN_ENABLE              OBSTAT0_DTCM0ECCEN(1)            /*!< DTCM0 ECC function enable */

/* option byte DTCM1 ECC function enable configuration */
#define OBSTAT0_DTCM1ECCEN(regval)        (BIT(24) & ((uint32_t)(regval) << 24U))
#define OB_DTCM1ECCEN_DISABLE             OBSTAT0_DTCM1ECCEN(0)            /*!< DTCM1 ECC function disable */
#define OB_DTCM1ECCEN_ENABLE              OBSTAT0_DTCM1ECCEN(1)            /*!< DTCM1 ECC function enable */

/* option byte I/O speed optimization configuration */
#define OBSTAT0_IOSPDOPEN(regval)         (BIT(29) & ((uint32_t)(regval) << 29U))
#define OB_IOSPDOPEN_DISABLE              OBSTAT0_IOSPDOPEN(0)             /*!< I/O speed optimization, high-speed at low-voltage diable */
#define OB_IOSPDOPEN_ENABLE               OBSTAT0_IOSPDOPEN(1)             /*!< I/O speed optimization, high-speed at low-voltage enable */

/* option byte security protection configuration */
#define FMC_NSPC                          ((uint8_t)0xAAU)                 /*!< no protection */
#define FMC_LSPC                          ((uint8_t)0xBBU)                 /*!< protection level low */
#define FMC_HSPC                          ((uint8_t)0xCCU)                 /*!< protection level high */

