RT-Thread-Studio/sdk-csp-gd32h7/libraries/GD32H75E_standard_peripheral/Include/gd32h75e_fmc.h
/* option byte DCRP erase enable configuration */
#define OB_DCRPADDR_DCRP_EREN(regval)     (BIT(31) & ((uint32_t)(regval) << 31U))
#define OB_DCRP_AREA_ERASE_DISABLE        OB_DCRPADDR_DCRP_EREN(0)         /*!< DCRP area erase disable */
#define OB_DCRP_AREA_ERASE_ENABLE         OB_DCRPADDR_DCRP_EREN(1)         /*!< DCRP area erase enable */

/* option byte secure-access erase enable configuration */
#define OB_SCRADDR_SCR_EREN(regval)       (BIT(31) & ((uint32_t)(regval) << 31U))
#define OB_SCR_AREA_ERASE_DISABLE         OB_SCRADDR_SCR_EREN(0)           /*!< secure-access area erase disable */
#define OB_SCR_AREA_ERASE_ENABLE          OB_SCRADDR_SCR_EREN(1)           /*!< secure-access area erase enable */

/* option byte erase/program protection */
#define OB_WP_0                           BIT(0)                           /*!< erase/program protection of sector 0~15 */
#define OB_WP_1                           BIT(1)                           /*!< erase/program protection of sector 16~31 */
#define OB_WP_2                           BIT(2)                           /*!< erase/program protection of sector 32~47 */
#define OB_WP_3                           BIT(3)                           /*!< erase/program protection of sector 48~63 */
#define OB_WP_4                           BIT(4)                           /*!< erase/program protection of sector 64~79 */
#define OB_WP_5                           BIT(5)                           /*!< erase/program protection of sector 80~95 */
#define OB_WP_6                           BIT(6)                           /*!< erase/program protection of sector 96~111 */
#define OB_WP_7                           BIT(7)                           /*!< erase/program protection of sector 112~127 */
#define OB_WP_8                           BIT(8)                           /*!< erase/program protection of sector 128~143 */
#define OB_WP_9                           BIT(9)                           /*!< erase/program protection of sector 144~159 */
#define OB_WP_10                          BIT(10)                          /*!< erase/program protection of sector 160~175 */
#define OB_WP_11                          BIT(11)                          /*!< erase/program protection of sector 176~191 */
#define OB_WP_12                          BIT(12)                          /*!< erase/program protection of sector 192~207 */
#define OB_WP_13                          BIT(13)                          /*!< erase/program protection of sector 208~223 */
#define OB_WP_14                          BIT(14)                          /*!< erase/program protection of sector 224~239 */
#define OB_WP_15                          BIT(15)                          /*!< erase/program protection of sector 240~255 */
#define OB_WP_16                          BIT(16)                          /*!< erase/program protection of sector 256~383 */
#define OB_WP_17                          BIT(17)                          /*!< erase/program protection of sector 384~511 */
#define OB_WP_18                          BIT(18)                          /*!< erase/program protection of sector 512~639 */
#define OB_WP_19                          BIT(19)                          /*!< erase/program protection of sector 640~767 */
#define OB_WP_20                          BIT(20)                          /*!< erase/program protection of sector 768~895 */
#define OB_WP_21                          BIT(21)                          /*!< erase/program protection of sector 896~1023 */
#define OB_WP_ALL                         BITS(0,29)                       /*!< erase/program protection of all sectors */

/* option byte DTCM size of shared RAM */
#define OBSTAT1_DTCM_SZ_SHRRAM(regval)    (BITS(4,7) & ((uint32_t)(regval) << 4U))
#define OB_DTCM_SHARED_RAM_0KB            OBSTAT1_DTCM_SZ_SHRRAM(0)        /*!< DTCM shared RAM size is 0KB */
#define OB_DTCM_SHARED_RAM_64KB           OBSTAT1_DTCM_SZ_SHRRAM(7)        /*!< DTCM shared RAM size is 64KB */
#define OB_DTCM_SHARED_RAM_128KB          OBSTAT1_DTCM_SZ_SHRRAM(8)        /*!< DTCM shared RAM size is 128KB */
#define OB_DTCM_SHARED_RAM_256KB          OBSTAT1_DTCM_SZ_SHRRAM(9)        /*!< DTCM shared RAM size is 256KB */
#define OB_DTCM_SHARED_RAM_512KB          OBSTAT1_DTCM_SZ_SHRRAM(10)       /*!< DTCM shared RAM size is 512KB */

/* option byte ITCM size of shared RAM */
#define OBSTAT1_ITCM_SZ_SHRRAM(regval)    (BITS(0,3) & ((uint32_t)(regval)))
#define OB_ITCM_SHARED_RAM_0KB            OBSTAT1_ITCM_SZ_SHRRAM(0)        /*!< ITCM shared RAM size is 0KB */
#define OB_ITCM_SHARED_RAM_64KB           OBSTAT1_ITCM_SZ_SHRRAM(7)        /*!< ITCM shared RAM size is 64KB */
#define OB_ITCM_SHARED_RAM_128KB          OBSTAT1_ITCM_SZ_SHRRAM(8)        /*!< ITCM shared RAM size is 128KB */
#define OB_ITCM_SHARED_RAM_256KB          OBSTAT1_ITCM_SZ_SHRRAM(9)        /*!< ITCM shared RAM size is 256KB */
#define OB_ITCM_SHARED_RAM_512KB          OBSTAT1_ITCM_SZ_SHRRAM(10)       /*!< ITCM shared RAM size is 512KB */

/* boot pin value definitions */
#define BOOT_PIN_0                        ((uint8_t)0x00U)              /*!< boot pin value is 0 */
#define BOOT_PIN_1                        ((uint8_t)0x01U)              /*!< boot pin value is 1 */

#define MAIN_FLASH_BASE_ADDRESS           ((uint32_t)0x08000000U)          /*!< main flash base address */
#define SCR_SIZE_UNIT                     ((uint32_t)0x00001000U)          /*!< secure-access area granularity */
#define DCRP_SIZE_UNIT                    ((uint32_t)0x00001000U)          /*!< DCRP area granularity */
#define FMC_TIMEOUT_COUNT                 ((uint32_t)0xFFFFFFFFU)          /*!< count to judge of FMC timeout */

#define INVLD_AREA_ADDRESS                ((uint8_t)0x00U)                 /*!< the area address is invalid */
#define VLD_AREA_ADDRESS                  ((uint8_t)0x01U)                 /*!< the area address is valid */

/* parameter check definitions */
#ifdef FW_DEBUG_ERR_REPORT
/* check erase address */
#define NOT_FMC_VALID_PAGEERASE_ADDR(addr)                      (((addr) < 0x08000000U) || ((addr) > 0x083BFFFFU))
/* check program address */
#define NOT_FMC_VALID_PROGRAM_ADDR(addr)                        (((addr) < 0x08000000U) || ((addr) > 0x083BFFFFU))
/* check security protection value */
#define NOT_FMC_SPC_VALUE(ob_spc)                               (((ob_spc) != FMC_NSPC) && ((ob_spc) != FMC_LSPC) && ((ob_spc) != FMC_HSPC))
/* check BOR threshold value */
#define NOT_FMC_BOR_TH(ob_bor_th)                               (((ob_bor_th) != OB_BOR_TH_VALUE3) && ((ob_bor_th) != OB_BOR_TH_VALUE2) && \
                                                                ((ob_bor_th) != OB_BOR_TH_VALUE1) && ((ob_bor_th) != OB_BOR_TH_OFF))
/* check watchdog value */
#define NOT_FMC_FWDGT_VALUE(ob_fwdgt)                           (((ob_fwdgt) != OB_FWDGT_SW) && ((ob_fwdgt) != OB_FWDGT_HW))
/* check deepsleep reset value */
#define NOT_FMC_DEEPSLEEP_VALUE(ob_deepsleep)                   (((ob_deepsleep) != OB_DEEPSLEEP_NRST) && ((ob_deepsleep) != OB_DEEPSLEEP_RST))
/* check standby reset value */
#define NOT_FMC_STDBY_VALUE(ob_stdby)                           (((ob_stdby) != OB_STDBY_NRST) && ((ob_stdby) != OB_STDBY_RST))
/* check FWDG suspend status in deep-sleep mode */
#define NOT_FMC_DPSLP_FWDGT_VALUE(fwdg_deepsleep)               (((fwdg_deepsleep) != OB_DPSLP_FWDGT_SUSPEND) && ((fwdg_deepsleep) != OB_DPSLP_FWDGT_RUN))
/* check FWDG suspend status in standby mode */
#define NOT_FMC_STDBY_FWDGT_VALUE(fwdg_standby)                 (((fwdg_standby) != OB_STDBY_FWDGT_SUSPEND) && ((fwdg_standby) != OB_STDBY_FWDGT_RUN))
/* check ITCM ECC function enable bit */
#define NOT_FMC_ITCMECCEN_VALUE(ob_itcmecc)                     (((ob_itcmecc) != OB_ITCMECCEN_DISABLE) && ((ob_itcmecc) != OB_ITCMECCEN_ENABLE))
/* check DTCM0 ECC function enable bit */
#define NOT_FMC_DTCM0ECCEN_VALUE(ob_dtcm0ecc)                   (((ob_dtcm0ecc) != OB_DTCM0ECCEN_DISABLE) && ((ob_dtcm0ecc) != OB_DTCM0ECCEN_ENABLE))
/* check DTCM1 ECC function enable bit */
#define NOT_FMC_DTCM1ECCEN_VALUE(ob_dtcm1ecc)                   (((ob_dtcm1ecc) != OB_DTCM1ECCEN_DISABLE) && ((ob_dtcm1ecc) != OB_DTCM1ECCEN_ENABLE))
/* check I/O speed optimization */
#define NOT_FMC_IOSPDOPEN_VALUE(ob_iospeed_op)                  (((ob_iospeed_op) != OB_IOSPDOPEN_DISABLE) && ((ob_iospeed_op) != OB_IOSPDOPEN_ENABLE))
/* check ITCM shared RAM size */
#define NOT_FMC_ITCM_SHARED_RAM_VALUE(itcm_ram_size)            (((itcm_ram_size) != OB_ITCM_SHARED_RAM_0KB) && ((itcm_ram_size) != OB_ITCM_SHARED_RAM_64KB) && \
                                                                ((itcm_ram_size) != OB_ITCM_SHARED_RAM_128KB) && ((itcm_ram_size) != OB_ITCM_SHARED_RAM_256KB) && \
                                                                ((itcm_ram_size) != OB_ITCM_SHARED_RAM_512KB))
/* check DTCM shared RAM size */
#define NOT_FMC_DTCM_SHARED_RAM_VALUE(dtcm_ram_size)            (((dtcm_ram_size) != OB_DTCM_SHARED_RAM_0KB) && ((dtcm_ram_size) != OB_DTCM_SHARED_RAM_64KB) && \
                                                                ((dtcm_ram_size) != OB_DTCM_SHARED_RAM_128KB) && ((dtcm_ram_size) != OB_DTCM_SHARED_RAM_256KB) && \
                                                                ((dtcm_ram_size) != OB_DTCM_SHARED_RAM_512KB))
/* check boot pin configuration */
#define NOT_FMC_BOOT_PIN_VALUE(boot_pin)                        (((boot_pin) != BOOT_PIN_0) && ((boot_pin) != BOOT_PIN_1))
/* check DCRP area erase enable bit */
#define NOT_FMC_DCRP_AREA_ERASE_STATUS(dcrp_eren)               (((dcrp_eren) != OB_DCRP_AREA_ERASE_DISABLE) && ((dcrp_eren) != OB_DCRP_AREA_ERASE_ENABLE))
/* check DCRP area start address */
#define NOT_FMC_DCRP_AREA_START(dcrp_start)                     ((dcrp_start) > 0x3BFU)
/* check DCRP area end address */
#define NOT_FMC_DCRP_AREA_END(dcrp_end)                         ((dcrp_end) > 0x3BFU)
/* check SCR area erase enable bit */
#define NOT_FMC_SCR_AREA_ERASE_STATUS(scr_eren)                 (((scr_eren) != OB_SCR_AREA_ERASE_DISABLE) && ((scr_eren) != OB_SCR_AREA_ERASE_ENABLE))
/* check SCR area start address */
#define NOT_FMC_SCR_AREA_START(scr_start)                       ((scr_start) > 0x3BFU)
/* check SCR area end address */
#define NOT_FMC_SCR_AREA_END(scr_end)                           ((scr_end) > 0x3BFU)
/* check erase/program protect sector */
#define NOT_FMC_OB_WP_VALUE(ob_wp)                              (((ob_wp) != OB_WP_0) && ((ob_wp) != OB_WP_1) && ((ob_wp) != OB_WP_2) && ((ob_wp) != OB_WP_3) && ((ob_wp) != OB_WP_4)&& \
                                                                ((ob_wp) != OB_WP_5) && ((ob_wp) != OB_WP_6) && ((ob_wp) != OB_WP_7) && ((ob_wp) != OB_WP_8) && ((ob_wp) != OB_WP_9) && \
                                                                ((ob_wp) != OB_WP_10) && ((ob_wp) != OB_WP_11) && ((ob_wp) != OB_WP_12) && ((ob_wp) != OB_WP_13) && ((ob_wp) != OB_WP_14) && \
                                                                ((ob_wp) != OB_WP_15) && ((ob_wp) != OB_WP_16) && ((ob_wp) != OB_WP_17) && ((ob_wp) != OB_WP_18) && ((ob_wp) != OB_WP_19) && \
                                                                ((ob_wp) != OB_WP_20) && ((ob_wp) != OB_WP_21) && ((ob_wp) != OB_WP_ALL))
/* check boot pin configuration */
#define NOT_FMC_BOOT_PIN(boot_pin)                              (((boot_pin) != BOOT_PIN_0) && ((boot_pin) != BOOT_PIN_1))
/* check DCRP area start address */
#define NOT_FMC_NODEC_AREA_START(nodec_start)                   ((nodec_start) > 0x3BFU)
/* check SCR area end address */
#define NOT_FMC_NODEC_AREA_END(nodec_end)                       ((nodec_end) > 0x3BFU)
#endif /* FW_DEBUG_ERR_REPORT */

/* function declarations */
/* FMC operation functions */
/* unlock FMC_CTL register */
void fmc_unlock(void);
/* lock FMC_CTL register */
void fmc_lock(void);
/* FMC erase sector */
fmc_state_enum fmc_sector_erase(uint32_t address);
/* FMC typical mass erase */
fmc_state_enum fmc_typical_mass_erase(void);
/* FMC protection-removed mass erase */
fmc_state_enum fmc_protection_removed_mass_erase(void);
/* FMC program a word at the corresponding address */
fmc_state_enum fmc_word_program(uint32_t address, uint32_t data);
/* FMC program a double-word at the corresponding address */
fmc_state_enum fmc_doubleword_program(uint32_t address, uint64_t data);
/* enable check programming area */
fmc_state_enum fmc_check_programming_area_enable(void);
/* disable check programming area */
fmc_state_enum fmc_check_programming_area_disable(void);

/* FMC option bytes operation functions */
/* unlock the option byte operation */
void ob_unlock(void);
/* lock the option byte operation */
void ob_lock(void);
/* send option bytes modification start command */
fmc_state_enum ob_start(void);
/* modify option byte to factory value */
fmc_state_enum ob_factory_value_config(void);
/* enable secure access mode */
fmc_state_enum ob_secure_access_mode_enable(void);
/* disable secure access mode */
fmc_state_enum ob_secure_access_mode_disable(void);
/* configure the option byte security protection level */
fmc_state_enum ob_security_protection_config(uint8_t ob_spc);
/* configure option byte BOR threshold value */
fmc_state_enum ob_bor_threshold_config(uint32_t ob_bor_th);
/* configure low power related option byte */
fmc_state_enum ob_low_power_config(uint32_t ob_fwdgt, uint32_t ob_deepsleep, uint32_t ob_stdby, uint32_t ob_fwdg_suspend_deepsleep,
                                   uint32_t ob_fwdg_suspend_standby);
/* configure TCM ECC option byte */
fmc_state_enum ob_tcm_ecc_config(uint32_t ob_itcmecc, uint32_t ob_dtcm0ecc, uint32_t ob_dtcm1ecc);
/* configure I/O speed optimization option byte */
fmc_state_enum ob_iospeed_optimize_config(uint32_t ob_iospeed_op);
/* configure option byte TCM shared RAM size */
fmc_state_enum ob_tcm_shared_ram_config(uint32_t itcm_shared_ram_size, uint32_t dtcm_shared_ram_size);
/* modify option byte DATA */
fmc_state_enum ob_data_program(uint16_t ob_data);
/* configure boot address */
fmc_state_enum ob_boot_address_config(uint8_t boot_pin, uint16_t boot_address);
/* configure DCRP area */
fmc_state_enum ob_dcrp_area_config(uint32_t dcrp_eren, uint32_t dcrp_start, uint32_t dcrp_end);
/* configure secure-access area */
fmc_state_enum ob_secure_area_config(uint32_t scr_eren, uint32_t scr_start, uint32_t scr_end);
/* enable erase/program protection */
fmc_state_enum ob_write_protection_enable(uint32_t ob_wp);
/* disable erase/program protection */
fmc_state_enum ob_write_protection_disable(uint32_t ob_wp);
/* get the option byte secure access mode */
FlagStatus ob_secure_mode_get(void);
/* get the option byte security protection level */
FlagStatus ob_security_protection_flag_get(void);
/* get the option byte BOR threshold value */
uint32_t ob_bor_threshold_get(void);
/* get low power related option byte */
void ob_low_power_get(uint32_t *fwdgt, uint32_t *deepsleep, uint32_t *standby, uint32_t *fwdg_suspend_deepsleep, uint32_t *fwdg_suspend_standby);
/* get TCM ECC configuration */
void ob_tcm_ecc_get(uint32_t *itcmecc_option, uint32_t *dtcm0ecc_option, uint32_t *dtcm1ecc_option);
/* get IO speed optimize configuration */
FlagStatus ob_iospeed_optimize_get(void);
/* get ITCM shared RAM size */
uint32_t ob_itcm_shared_ram_size_get(void);
/* get DTCM shared RAM size */
uint32_t ob_dtcm_shared_ram_size_get(void);
/* get user data value */
uint16_t ob_data_get(void);
/* get boot address */
uint32_t ob_boot_address_get(uint8_t boot_pin);
/* get DCRP area configuration */
uint8_t ob_dcrp_area_get(uint32_t *dcrp_erase_option, uint32_t *dcrp_area_start_addr, uint32_t *dcrp_area_end_addr);
/* get secure-access area configuration */
uint8_t ob_secure_area_get(uint32_t *secure_area_option, uint32_t *scr_area_start_addr, uint32_t *scr_area_end_addr);
/* get the option byte erase/program protection state */
uint32_t ob_write_protection_get(void);

/* FMC universal functions */
/* configure NO-RTDEC area */
fmc_state_enum fmc_no_rtdec_config(uint32_t nodec_area_start, uint32_t nodec_area_end);
/* configure aes initialization vector */
fmc_state_enum fmc_aes_iv_config(uint32_t *aes_iv);
/* get Flash ECC function enable flag */
FlagStatus fmc_flash_ecc_get(void);
/* get NO-RTDEC area */
void fmc_no_rtdec_get(uint32_t *nodec_area_start, uint32_t *nodec_area_end);
/* get AES initialization vector */
void fmc_aes_iv_get(uint32_t *aes_iv);
/* get product ID */
void fmc_pid_get(uint32_t *pid);

/* interrupt & flag functions */
/* get FMC flag status */
FlagStatus fmc_flag_get(fmc_flag_enum flag);
/* clear FMC flag status */
void fmc_flag_clear(fmc_flag_enum flag);
/* enable FMC interrupt */
void fmc_interrupt_enable(fmc_interrupt_enum interrupt);
/* disable FMC interrupt */
void fmc_interrupt_disable(fmc_interrupt_enum interrupt);
/* get FMC interrupt flag status */
FlagStatus fmc_interrupt_flag_get(fmc_interrupt_flag_enum int_flag);
/* clear FMC interrupt flag status */
void fmc_interrupt_flag_clear(fmc_interrupt_flag_enum int_flag);

#endif /* GD32H75E_FMC_H */
